ext_b24/DataProcessors/алсавб24_ВыгрузкаКонтрагентов_БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>алсавб24_ВыгрузкаКонтрагентов_БанковскиеСчета</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ext_b24/InformationRegisters/алсавб24_СопоставлениеОбъектовБ24.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>алсавб24_СопоставлениеОбъектовБ24</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объект1С</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>TITLE</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ENTITY_ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ENTITY_TYPE_ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_b24/DataProcessors/алсавб24_ВыгрузкаКонтрагентов_БанковскиеСчета/Ext/ManagerModule.bsl
///************
// Выгрузка банковских счетов контрагента (crm.requisite.bankdetail)
//
///************

///
/// // Создать банковские счета для контрагента
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - ссылка на контрагента
//  IDРеквизитов - Число - ID универсальных реквизитов в Б24
//
Процедура СоздатьБанковскиеСчетаКонтрагента(Контрагент, IDРеквизитов) Экспорт

	// Получаем банковские счета контрагента
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	БанковскиеСчетаКонтрагентов.Ссылка КАК Ссылка,
		|	БанковскиеСчетаКонтрагентов.НомерСчета КАК НомерСчета,
		|	БанковскиеСчетаКонтрагентов.Банк КАК Банк,
		|	БанковскиеСчетаКонтрагентов.ВалютаДенежныхСредств КАК Валюта,
		|	БанковскиеСчетаКонтрагентов.Наименование КАК Наименование
		|ИЗ
		|	Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
		|ГДЕ
		|	БанковскиеСчетаКонтрагентов.Владелец = &Контрагент
		|	И НЕ БанковскиеСчетаКонтрагентов.ПометкаУдаления";

	Запрос.УстановитьПараметр("Контрагент", Контрагент);

	Результат = Запрос.Выполнить();

	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();

		Пока Выборка.Следующий() Цикл
			// Создаем банковские реквизиты в Б24
			ПоляБанковскогоСчета = ПодготовитьПоляБанковскогоСчета(Выборка, IDРеквизитов);

			APIРезультат = Обработки.алсавб24_api_CRM_БанковскиеРеквизиты.crm_requisite_bankdetail_add(ПоляБанковскогоСчета);

			Если APIРезультат.Свойство("result") Тогда
				IDБанковскогоСчета = APIРезультат.result;
				// Регистрируем сопоставление банковского счета
				ЗарегистрироватьСопоставлениеБанковскогоСчета(IDБанковскогоСчета, Выборка.Ссылка, Выборка.Наименование);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

///
/// // Обновить банковские счета для контрагента
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - ссылка на контрагента
//  IDРеквизитов - Число - ID универсальных реквизитов в Б24
//
Процедура ОбновитьБанковскиеСчетаКонтрагента(Контрагент, IDРеквизитов) Экспорт

	// Получаем банковские счета контрагента
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	БанковскиеСчетаКонтрагентов.Ссылка КАК Ссылка,
		|	БанковскиеСчетаКонтрагентов.НомерСчета КАК НомерСчета,
		|	БанковскиеСчетаКонтрагентов.Банк КАК Банк,
		|	БанковскиеСчетаКонтрагентов.ВалютаДенежныхСредств КАК Валюта,
		|	БанковскиеСчетаКонтрагентов.Наименование КАК Наименование
		|ИЗ
		|	Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
		|ГДЕ
		|	БанковскиеСчетаКонтрагентов.Владелец = &Контрагент
		|	И НЕ БанковскиеСчетаКонтрагентов.ПометкаУдаления";

	Запрос.УстановитьПараметр("Контрагент", Контрагент);

	Результат = Запрос.Выполнить();

	// Получаем существующие банковские счета в Б24
	APIРезультат = Обработки.алсавб24_api_CRM_БанковскиеРеквизиты.crm_requisite_bankdetail_list_by_entity(
		IDРеквизитов, Обработки.алсавб24_api_CRM_Common.ENTITY_TYPE_ID_УниверсальныеРеквизиты());

	// Создаем соответствие для поиска существующих счетов
	СоответствиеСуществующих = Новый Соответствие;
	Для Каждого БанковскийСчет Из APIРезультат.result Цикл
		НомерСчета = БанковскийСчет.Получить("RQ_ACC_NUM");
		Если НомерСчета <> Неопределено Тогда
			СоответствиеСуществующих.Вставить(НомерСчета, БанковскийСчет.Получить("ID"));
		КонецЕсли;
	КонецЦикла;

	// Обрабатываем каждый банковский счет
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл

		IDБанковскогоСчета = СоответствиеСуществующих.Получить(Выборка.НомерСчета);

		Если IDБанковскогоСчета <> Неопределено Тогда
			// Обновляем существующий банковский счет
			ПоляОбновления = ПодготовитьПоляБанковскогоСчета(Выборка, IDРеквизитов);

			Обработки.алсавб24_api_CRM_БанковскиеРеквизиты.crm_requisite_bankdetail_update(IDБанковскогоСчета, ПоляОбновления);
		Иначе
			// Создаем новый банковский счет
			ПоляБанковскогоСчета = ПодготовитьПоляБанковскогоСчета(Выборка, IDРеквизитов);

			APIРезультатСоздания = Обработки.алсавб24_api_CRM_БанковскиеРеквизиты.crm_requisite_bankdetail_add(ПоляБанковскогоСчета);

			Если APIРезультатСоздания.Свойство("result") Тогда
				IDНовогоБанковскогоСчета = APIРезультатСоздания.result;
				ЗарегистрироватьСопоставлениеБанковскогоСчета(IDНовогоБанковскогоСчета, Выборка.Ссылка, Выборка.Наименование);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

///
/// // Подготовить поля банковского счета для API
// Параметры:
//  БанковскийСчет - ВыборкаИзРезультатаЗапроса - данные банковского счета
//  IDРеквизитов - Число - ID универсальных реквизитов в Б24
// Возвращаемое значение:
//  Структура - поля для API
//
Функция ПодготовитьПоляБанковскогоСчета(БанковскийСчет, IDРеквизитов)

	Поля = Новый Структура;

	// Основные поля
	Поля.Вставить("ENTITY_ID", IDРеквизитов);
	Поля.Вставить("ENTITY_TYPE_ID", Обработки.алсавб24_api_CRM_Common.ENTITY_TYPE_ID_УниверсальныеРеквизиты());
	Поля.Вставить("NAME", БанковскийСчет.Наименование);

	// Данные банковского счета
	Поля.Вставить("RQ_ACC_NUM", БанковскийСчет.НомерСчета);
	Поля.Вставить("RQ_ACC_NAME", БанковскийСчет.Наименование);

	// Данные банка
	Если ЗначениеЗаполнено(БанковскийСчет.Банк) Тогда
		Поля.Вставить("RQ_BANK_NAME", БанковскийСчет.Банк.Наименование);
		Поля.Вставить("RQ_BANK_ADDR", БанковскийСчет.Банк.Адрес);
		Поля.Вставить("RQ_BANK_BIK", БанковскийСчет.Банк.Код);
		Поля.Вставить("RQ_BANK_CORR_ACC_NUM", БанковскийСчет.Банк.КоррСчет);
	КонецЕсли;

	// Валюта счета
	Если ЗначениеЗаполнено(БанковскийСчет.Валюта) Тогда
		Поля.Вставить("RQ_ACC_CURRENCY", БанковскийСчет.Валюта.Наименование);
	КонецЕсли;

	Возврат Поля;

КонецФункции

///
/// // Зарегистрировать сопоставление банковского счета
// Параметры:
//  IDБанковскогоСчета - Число - ID банковского счета в Б24
//  БанковскийСчет1С - СправочникСсылка.БанковскиеСчетаКонтрагентов - ссылка на банковский счет 1С
//  Наименование - Строка - наименование для TITLE
//
Процедура ЗарегистрироватьСопоставлениеБанковскогоСчета(IDБанковскогоСчета, БанковскийСчет1С, Наименование) Экспорт

	НаборЗаписей = РегистрыСведений.алсавб24_СопоставлениеОбъектовБ24.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ENTITY_ID.Установить(IDБанковскогоСчета);

	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.ENTITY_ID = IDБанковскогоСчета;
	НоваяЗапись.ENTITY_TYPE_ID = Обработки.алсавб24_api_CRM_Common.ENTITY_TYPE_ID_УниверсальныеРеквизиты(); // Банковские счета привязаны к реквизитам
	НоваяЗапись.Объект1С = БанковскийСчет1С;
	НоваяЗапись.TITLE = Наименование;

	НаборЗаписей.Записать();

КонецПроцедуры
